# while：可以理解为“直到……为止”“当……”
'''while条件: i <= 1000
    循环体内执行的代码

    处理条件（计数器）'''

# 没有处理条件，进入死循环
'''
i = 1
while i <= 10:      #这个条件恒成立，进入死循环，会一直执行循环体内部的代码
    print('i love you')
    '''

i = 1
while i <= 3:
    print('i love you')
    i += 1


#1）在while定义一个变量，用来存放最终计算的结果
#2）在循环体内部，每次循环都用最新的计算结果，来更新定义的变量

#例1：计算1-100的累计和
i = 1   # 计数器，定义次数的变量
sum = 0 # 定义的最终结果的变量
while i <=100:
    # 每一次循环，都让sum这个变量和i相加
    sum = sum + i
    i += 1  # 自加操作，循环100次
print(f'1-100的累计和:{sum}')

#例2：计算1-100偶数的累计和
i = 0
sum = 0
while i <=100:
    sum = sum + i
    i += 2  # 自加操作，循环100次
print(f'1-100偶数的累计和:{sum}')
'''第二种写法：
i = 0
while i <=100:
    if i % 2 == 0:
        sum = sum + i
    i += 1
print(f'1-100偶数的累计和:{sum}')'''

#常见错误#
i = 1
sum = 0
while i <=100:
    i += 1      #实际上加到了102，求的是2-102的累计和
    sum = sum + i
print(f'1-100的累计和:{sum}')

