# 二、修改元素：本质是赋值操作
# 1）修改单个元素
nums=[1,5,7,8,9,4]
nums[2]=6     # 通过下标访问指定元素，然后再给该元素赋新值
print(nums)
# 2）修改一组元素
nums[4:6]=[10,12]       # 左右两边个数一致
print(nums)

# 3）特殊情况：对空切片赋值
print(nums[4:4])        # []
nums[4:4]=[-1,-2,-3]    # 从下标为4的前面插入所有元素
''' nums[4:4] = -3 
    会报错，只能赋予为一个可迭代对象.
    将-3修正为[-3]即可，即nums[4:4] = [-3] '''
print(nums)             # [1, 5, 6, 8, -1, -2, -3, 10, 12]

# 4）间隔操作
nums_1=[1,2,3,4,5,6,7,8,9,10]
nums_1[1:10:2]=['-','-','-','-','-']    # 也可以是数字
print(nums_1)
